---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.SpaceFilter.#ctor
source: html/936c55c6-1782-c9c0-a042-087fc39e2cc3.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceFilter.#ctor Method

Constructs a filter which matches only spaces.

## Syntax (C#)
```csharp
public SpaceFilter()
```